Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 normalization (Normalizatio  (None, 59)               119       
 n)                                                              
                                                                 
 dense (Dense)               (None, 64)                3840      
                                                                 
 dropout (Dropout)           (None, 64)                0         
                                                                 
 dense_1 (Dense)             (None, 128)               8320      
                                                                 
 dropout_1 (Dropout)         (None, 128)               0         
                                                                 
 dense_2 (Dense)             (None, 128)               16512     
                                                                 
 dropout_2 (Dropout)         (None, 128)               0         
                                                                 
 dense_3 (Dense)             (None, 256)               33024     
                                                                 
 dropout_3 (Dropout)         (None, 256)               0         
                                                                 
 dense_4 (Dense)             (None, 1)                 257       
                                                                 
=================================================================
Total params: 62,072
Trainable params: 61,953
Non-trainable params: 119
_________________________________________________________________


Optimizer: <keras.optimizers.optimizer_v2.adam.Adam object at 0x0000023B9F4C59F0> 
Loss function: <keras.losses.BinaryCrossentropy object at 0x0000023B9F542FE0> 
Notes: 
----------------------------------------------------------------------
Loss on test dataset: 0.5934 
AUC: 0.7367672042962353
Precision-recall AUC: 0.3474859211868666
----------------------------------------------------------------------
              precision    recall  f1-score   support

           0       0.91      0.68      0.78     18222
           1       0.29      0.67      0.41      3621

    accuracy                           0.68     21843
   macro avg       0.60      0.68      0.59     21843
weighted avg       0.81      0.68      0.72     21843
